package Task141122;

/**
 * 43. Напишите программу на
 * Java для печати следующей строки в определенном формате
 */
public class Lesson43 {
    public static void main(String[] args) {
        System.out.println("\nМерцание, мерцание, маленькая звезда," +
                "\n\tКак я жажду узнать, кто ты! " +
                "\n\t\tПодняться над миром так высоко, " +
                "\n\t\tКак алмаз в небе. " +
                "\nМерцание, мерцание, маленькая звезда, " +
                "\n\tКак я жажду узнать, кто ты\n\n");
    }
}
